# Download with resuming and segmented downloading
brew "aria2"
# Fast, lightweight CLI for App Store Connect
brew "asc"
# Code searching, linting, rewriting
brew "ast-grep"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Copy files from your terminal that actually paste into GUI apps
brew "clippy"
# Cross-platform make
brew "cmake"
# Command-line interface built-in Visual Studio Code
brew "code-cli"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Keyless Git signing using Sigstore
brew "gitsign"
# Render markdown on the CLI
brew "glow"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Duplicate file finder and an enhanced fork of 'fdupes'
brew "jdupes"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Run local Kubernetes cluster in Docker
brew "kind"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# NCurses Disk Usage
brew "ncdu"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# Your own personal AI assistant
brew "openclaw-cli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Non-interactive SSH password auth
brew "sshpass"
# Manipulate and query tags on macOS files
brew "tag"
# Tool to build, change, and version infrastructure
brew "terraform"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terraform version manager inspired by rbenv
brew "tfenv", link: false
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Tool for managing your YubiKey configuration
brew "ykman"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Menu bar usage monitor for Codex and Claude
cask "codexbar"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Clipboard manager
cask "jumpcut"
# Create, maintain, and interact with Xcode projects at scale
cask "tuist"
# Virtual machines UI using QEMU
cask "utm"
