tap "anomalyco/tap"
tap "arthur-ficial/tap"
tap "bendews/tap"
tap "infisical/get-cli"
tap "kezhenxu94/tap"
tap "local/apw-native-dev"
tap "theboredteam/boring-notch"
brew "aria2"
brew "asc"
brew "ast-grep"
brew "awscli"
brew "bat"
brew "bitwarden-cli"
brew "clippy"
brew "cmake"
brew "code-cli"
brew "colima"
brew "deno"
brew "exiftool"
brew "eza"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitsign"
brew "glow"
brew "hcloud"
brew "helm"
brew "httpie"
brew "jdupes"
brew "jq"
brew "k3d"
brew "kind"
brew "kustomize"
brew "lazygit"
brew "lsd"
brew "ncdu"
brew "neofetch"
brew "oci-cli"
brew "openclaw-cli"
brew "ripgrep"
brew "opencode"
brew "pipx"
brew "playwright-cli"
brew "pnpm"
brew "podman"
brew "python@3.11"
brew "python@3.12"
brew "rsync"
brew "rtk"
brew "rust"
brew "sshpass"
brew "starship"
brew "tag"
brew "terraform"
brew "tesseract"
brew "tfenv", link: false
brew "tlrc"
brew "tmux"
brew "tree"
brew "xcodegen"
brew "xcodes"
brew "ykman"
brew "zoxide"
brew "arthur-ficial/tap/apfel"
brew "infisical/get-cli/infisical"
brew "local/apw-native-dev/apw"
cask "anaconda"
cask "claude-code"
cask "codex"
cask "codexbar"
cask "db-browser-for-sqlite"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "jumpcut"
cask "tuist"
cask "utm"
vscode "[2026-04-11 16:49:06] info searching for installations on your machine, this is done once and will take about 10 seconds..."
vscode "no installation of code oss was found."
vscode ""
vscode "if you already installed code and we didn't detect it, run `code version use oss --install-dir /path/to/installation`"
cargo "apw"
cargo "just"
cargo "tauri-cli"
